In [1]:
# Import statements
import pandas as pd

In [ ]:
#Pulling the dataset
df = pd.read_csv("Salaries_By_College_Major.csv")

In [6]:
# Outline of the dataset

df.head()
df.shape
df.columns
        #  Can rename columns using :
            # df = df.rename(columns={"old_name": "new_name"})
            # the entire set can be replaced using; df.columns = ["name1", "name2", "name3"]
df.dtypes
        # Can adjsut it using:    df["col"] = df["col"].astype("int")
        # For multiple ones9 same thing but as a dictionary : df = df.astype({
                                     #                                           "age": "int",
                                     #                                           "price": "float",
                                     #                                           "date": "datetime64[ns]"
                                     #                                       })

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
count,50.000000,50.00000,50.000000,50.000000
mean,44310.000000,74786.00000,43408.000000,142766.000000
std,9360.866217,16088.40386,12000.779567,27851.249267
min,34000.000000,52000.00000,26700.000000,96400.000000
25%,37050.000000,60825.00000,34825.000000,124250.000000
50%,40850.000000,72000.00000,39400.000000,145500.000000
75%,49875.000000,88750.00000,49850.000000,161750.000000
max,74300.000000,107000.00000,71900.000000,210000.000000

In [8]:
# Handle missing values
    # Understanding the missing values
df.isna().sum()



    # Remove missing values
df.dropna()
            #default will be how= any - where all the values will be removed
            # can also do how= all  - where the line gets dropped only if all the values are missing.

Undergraduate Major                  0
Starting Median Salary               1
Mid-Career Median Salary             1
Mid-Career 10th Percentile Salary    1
Mid-Career 90th Percentile Salary    1
Group                                1
dtype: int64

In [19]:
# Accessing columns and the cells in the dataset

    # Getting access to one column
df["Starting Median Salary"]

    # Can access using a row value and column value
# df.loc( rows index value, column index value)
df.loc[43, "Starting Median Salary"]
df.loc[43]
df.loc[43, ["Undergraduate Major", "Starting Median Salary"]]
df.loc[10:20, :]
        # Can apply specific conditions to it as well.


    # Can access them depending on their positions.
# df.iloc[row_positions, column_positions]
df.iloc[3, 2]     # row 3, column 2
df.iloc[3, [0, 2, 4]]
df.iloc[[1, 5, 7], :]

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
10,Civil Engineering,53900.0,90500.0,63400.0,148000.0,STEM
11,Communications,38100.0,70000.0,37500.0,143000.0,HASS
12,Computer Engineering,61400.0,105000.0,66100.0,162000.0,STEM
13,Computer Science,55900.0,95500.0,56000.0,154000.0,STEM
14,Construction,53700.0,88900.0,56300.0,171000.0,Business
15,Criminal Justice,35000.0,56300.0,32200.0,107000.0,HASS
16,Drama,35900.0,56900.0,36700.0,153000.0,HASS
17,Economics,50100.0,98600.0,50600.0,210000.0,Business
18,Education,34900.0,52000.0,29300.0,102000.0,HASS
19,Electrical Engineering,60900.0,103000.0,69300.0,168000.0,STEM
20,English,38000.0,64700.0,33400.0,133000.0,HASS

In [ ]:
## Finding the max or the min

    # Max value
df["Starting Median Salary"].max()
    # Max value id
df["Starting Median Salary"].idxmax()